app/views/comments/_comments.html.slim

SELECT "users".* FROM "users"  WHERE "users"."id" IN (2)
---
- comments.includes(:user).each do |comment|
  .comment