app/views/articles/index.html.slim

SELECT "users".* FROM "users"  WHERE "users"."id" IN (0)
---
      article
        - articles.includes(:user).each do |article|