app/controllers/articles_controller.rb

  def create
    article = articles.new(articles_params)
    article.save
---
INSERT INTO "articles" ("created_at", "text", "title", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["created_at", "2015-05-05 18:37:02.122923"], ["text", "ывы"], ["title", "ывы"], ["updated_at", "2015-05-05 18:37:02.122923"], ["user_id", 2]]

  def destroy
    article.destroy
---
DELETE FROM "articles" WHERE "articles"."id" = $1  [["id", 1]]

  def update
    article.update(articles_params)
---
UPDATE "articles" SET "image_file_name" = $1, "image_file_size" = $2, "image_updated_at" = $3, "updated_at" = $4 WHERE "articles"."id" = 9  [["image_file_name", "earth-910499-7680x4320.jpg"], ["image_file_size", 1103111], ["image_updated_at", "2014-12-25 19:41:27.863072"], ["updated_at", "2014-12-25 19:41:31.044327"]]